# BeamVJustificationOtherValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BeamVJustificationOtherValue Property
ParameterTypeId Class See Also
---
"z-Direction Offset Value"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BeamVJustificationOtherValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BeamVJustificationOtherValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BeamVJustificationOtherValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace